Merge pull request #61 from kayaman/fixes/ai
feat: reorganizing
