--- a/src/content/docs/archive/random/eda_vs_mda.md
+++ b/src/content/docs/archive/random/eda_vs_mda.md
@@ -87,17 +87,21 @@ graph TD;
 
 #### **Example**
 
-```plantuml
-@startuml
-Client -> Queue : Send "Process Payment" message
-Queue -> Worker : Worker pulls message
-Worker -> DB : Process transaction
-Worker -> Queue : Send "Payment Completed" message
-Queue -> Client : Deliver response
-@enduml
+```mermaid
+sequenceDiagram
+    participant Client
+    participant Queue
+    participant Worker
+    participant DB
+
+    Client->>Queue: Send "Process Payment" message
+    Queue->>Worker: Worker pulls message
+    Worker->>DB: Process transaction
+    Worker->>Queue: Send "Payment Completed" message
+    Queue->>Client: Deliver response
 ```
 
----
+***
